CSI API ETABS v1
cPropLink.SetDamper Method
 Initializes a damper-type link property. If this function is called for an existing link property, all items for the property are reset to their default values.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDamper(
	string Name,
	ref bool[] DOF,
	ref bool[] Fixed,
	ref bool[] Nonlinear,
	ref double[] Ke,
	ref double[] Ce,
	ref double[] K,
	ref double[] C,
	ref double[] CExp,
	double DJ2,
	double DJ3,
	string Notes = "",
	string GUID = ""
)
Function SetDamper (
	Name As String,
	ByRef DOF As Boolean(),
	ByRef Fixed As Boolean(),
	ByRef Nonlinear As Boolean(),
	ByRef Ke As Double(),
	ByRef Ce As Double(),
	ByRef K As Double(),
	ByRef C As Double(),
	ByRef CExp As Double(),
	DJ2 As Double,
	DJ3 As Double,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim DOF As Boolean()
Dim Fixed As Boolean()
Dim Nonlinear As Boolean()
Dim Ke As Double()
Dim Ce As Double()
Dim K As Double()
Dim C As Double()
Dim CExp As Double()
Dim DJ2 As Double
Dim DJ3 As Double
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetDamper(Name,
	DOF, Fixed, Nonlinear, Ke, Ce, K, C,
	CExp, DJ2, DJ3, Notes, GUID)
int SetDamper(
	String^ Name,
	array<bool>^% DOF,
	array<bool>^% Fixed,
	array<bool>^% Nonlinear,
	array<double>^% Ke,
	array<double>^% Ce,
	array<double>^% K,
	array<double>^% C,
	array<double>^% CExp,
	double DJ2,
	double DJ3,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetDamper :
        Name : string *
        DOF : bool[] byref *
        Fixed : bool[] byref *
        Nonlinear : bool[] byref *
        Ke : float[] byref *
        Ce : float[] byref *
        K : float[] byref *
        C : float[] byref *
        CExp : float[] byref *
        DJ2 : float *
        DJ3 : float *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
The name of an existing or new link property. If this is an existing property, that property is modified; otherwise, a new property is added
DOF
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if properties exist for a specified degree of freedom.
Value | DOF
DOF(0) | U1
DOF(1) | U2
DOF(2) | U3
DOF(3) | R1
DOF(4) | R2
DOF(5) | R3
Fixed
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if the specified degree of freedom is fixed (restrained).
Value | Fixity
Fixed(0) | U1 fixity if DOF(0) = True
Fixed(1) | U2 fixity if DOF(1) = True
Fixed(2) | U3 fixity if DOF(2) = True
Fixed(3) | R1 fixity if DOF(3) = True
Fixed(4) | R2 fixity if DOF(4) = True
Fixed(5) | R3 fixity if DOF(5) = True
The term Fixed(n) applies only when DOF(n) = True.
Nonlinear
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if nonlinear properties exist for a specified degree of freedom.
Value | Nonlinear
Nonlinear(0) | U1 has nonlinear properties
Nonlinear(1) | U2 has nonlinear properties
Nonlinear(2) | U3 has nonlinear properties
Nonlinear(3) | R1 has nonlinear properties
Nonlinear(4) | R2 has nonlinear properties
Nonlinear(5) | R3 has nonlinear properties
The term Nonlinear(n) applies only when DOF(n) = True and Fixed(n) = False.
Ke
Type: System.Double[]
This is an array of effective stiffness terms for the link property. The effective stiffness applies for linear analyses.
Value | Stiffness
Ke(0) | U1 [F/L]
Ke(1) | U2 [F/L]
Ke(2) | U3 [F/L]
Ke(3) | R1 [FL]
Ke(4) | R2 [FL]
Ke(5) | R3 [FL]
The term ke(n) applies only when DOF(n) = True and Fixed(n) = False.
Ce
Type: System.Double[]
This is an array of effective damping terms for the link property. The effective stiffness applies for linear analyses.
Value | Damping
Ce(0) | U1 [F/L]
Ce(1) | U2 [F/L]
Ce(2) | U3 [F/L]
Ce(3) | R1 [FL]
Ce(4) | R2 [FL]
Ce(5) | R3 [FL]
The term ce(n) applies only when DOF(n) = True and Fixed(n) = False.
K
Type: System.Double[]
This is an array of initial stiffness terms for the link property. The initial stiffness applies for nonlinear analyses.
Value | Stiffness
K(0) | U1 [F/L]
K(1) | U2 [F/L]
K(2) | U3 [F/L]
K(3) | R1 [FL]
K(4) | R2 [FL]
K(5) | R3 [FL]
The term k(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
C
Type: System.Double[]
This is an array of nonlinear damping coefficient terms for the link property. The nonlinear damping coefficient applies for nonlinear analyses.
Value | Damping
C(0) | U1 [F/(L^cexp)]
C(1) | U2 [F/(L^cexp)]
C(2) | U3 [F/(L^cexp)]
C(3) | R1 [FL]
C(4) | R2 [FL]
C(5) | R3 [FL]
The term c(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
CExp
Type: System.Double[]
This is an array of the nonlinear damping exponent terms. The nonlinear damping exponent applies for nonlinear analyses. It is applied to the velocity across the damper in the equation of motion.
Value | CExp
cexp(0) | U1
cexp(1) | U2
cexp(2) | U3
cexp(3) | R1
cexp(4) | R2
cexp(5) | R3
The term cexp(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
DJ2
Type: System.Double
The distance from the J-End of the link to the U2 shear spring. This item applies only when DOF(1) = True. [L]
DJ3
Type: System.Double
The distance from the J-End of the link to the U3 shear spring. This item applies only when DOF(2) = True. [L]
Notes (Optional)
Type: System.String
The notes, if any, assigned to the property.
GUID (Optional)
Type: System.String
The GUID (global unique identifier), if any, assigned to the property. If this item is input as Default, the program assigns a GUID to the property.
Return Value
Type: Int32
Returns zero if the property is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyDOF() As Boolean
       Dim MyFixed() As Boolean
       Dim MyNonLinear() as Boolean
       Dim MyKe() As Double
       Dim MyCe() As Double
       Dim MyK() As Double
       Dim MyC() As Double
       Dim MyCexp() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim MyDOF(5)
       ReDim MyFixed(5)
       ReDim MyNonLinear(5)
       ReDim MyKe(5)
       ReDim MyCe(5)
       ReDim MyK(5)
       ReDim MyC(5)
       ReDim MyCexp(5)
       MyDOF(0) = True
       MyKe(0) = 12
       MyCe(0) = 0.01
       MyDOF(1) = True
       MyNonLinear(1) = True
       MyKe(1) = 12
       MyCe(1) = 0.01
       MyK(1) = 20
       MyC(1)=0.08
       MyCexp(1) = 1.2
       MyDOF(2) = True
       MyFixed(2) = True
       ret = SapModel.PropLink.SetDamper("D1", MyDOF, MyFixed, MyNonLinear, MyKe, MyCe, MyK, MyC, MyCexp, 1, 0)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace